Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.141/atdf/PIC32CM2532LE00048.atdf
        <module name="MPU" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
            <parameters>
              <param name="__MPU_REGIONS" value="12" caption="Number of MPU regions"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="71" caption="Number of interrupt request lines"/>
            </parameters>
          </instance>
        </module>
        <module name="NVMCTRL" id="U2802" version="1.1.0">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <signals>
              <signal group="MARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="DATAFLASH_PAGES" value="128"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="ROW_PAGES" value="4"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Security Configuration implemented?"/>
              <param name="FLASH_SIZE" value="262144"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="4096"/>
              <param name="PAGES_PR_REGION" value="256"/>
              <param name="INSTANCE_ID" value="34" caption="Instance index for NVMCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2802" version="1.1.0">
          <instance name="FUSES">
            <register-group name="BOCOR_FUSES" name-in-module="BOCOR_FUSES" address-space="fuses" offset="0x0080C000"/>
            <register-group name="OTP1_FUSES" name-in-module="OTP1_FUSES" address-space="fuses" offset="0x00806000"/>
            <register-group name="OTP2_FUSES" name-in-module="OTP2_FUSES" address-space="fuses" offset="0x00806008"/>
            <register-group name="SW_CALIB_FUSES" name-in-module="SW_CALIB_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="OPAMP" id="U2237" version="2.0.0">
          <instance name="OPAMP">
            <register-group name="OPAMP" name-in-module="OPAMP" address-space="base" offset="0x42005000"/>
            <signals>
              <signal group="OANEG" index="0" function="B" pad="PA02"/>
              <signal group="OANEG" index="1" function="B" pad="PA00"/>
              <signal group="OANEG" index="2" function="B" pad="PA03"/>
              <signal group="OAOUT" index="0" function="B" pad="PA07"/>
              <signal group="OAOUT" index="2" function="B" pad="PA04"/>
              <signal group="OAPOS" index="0" function="B" pad="PA06"/>
              <signal group="OAPOS" index="1" function="B" pad="PA01"/>
              <signal group="OAPOS" index="2" function="B" pad="PA05"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="84" caption="Instance index for OPAMP"/>
              <param name="NUM_OPAMPS" value="3" caption="Number of op amps"/>
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="U2246" version="4.0.0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x40001400"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PA00"/>
              <signal group="XOUT32" function="XOUT32" pad="PA01"/>
            </signals>
            <parameters>
              <param name="OSC32K_COARSE_CALIB_MSB" value="0"/>
              <param name="INSTANCE_ID" value="5" caption="Instance index for OSC32KCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="OSCCTRL" id="U2119" version="5.0.0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x40001000"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PA14"/>
              <signal group="XOUT" function="XOUT" pad="PA15"/>
            </signals>
            <parameters>
              <param name="DFLL48M_COARSE_MSB" value="5"/>
              <param name="DFLL48M_FINE_MSB" value="9"/>
              <param name="GCLK_ID_DFLLULP" value="2" caption="Index of Generic Clock for DFLLULP"/>
              <param name="GCLK_ID_DFLL48M" value="3" caption="Index of Generic Clock for DFLL48M"/>
              <param name="GCLK_ID_FDPLL" value="0" caption="Index of Generic Clock for DPLL"/>
              <param name="GCLK_ID_FDPLL32K" value="1" caption="Index of Generic Clock for DPLL 32K"/>
              <param name="CFD_VERSION" value="0x112"/>
              <param name="DFLLULP_VERSION" value="0x100"/>
              <param name="DFLL48M_VERSION" value="0x3d0"/>
              <param name="FDPLL_VERSION" value="0x213"/>
              <param name="OSC16M_VERSION" value="0x102"/>
              <param name="XOSC_VERSION" value="0x210"/>
              <param name="INSTANCE_ID" value="4" caption="Instance index for OSCCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="U2120" version="2.0.0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="HPB_NUM" value="3" caption="Number of bridges AHB/APB"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Security Configuration implemented?"/>
              <param name="INSTANCE_ID" value="0" caption="Instance index for PAC"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2240" version="3c0">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="BIAS_RAM_HS" value="1" caption="one if RAM HS can be back biased"/>
              <param name="PD_NUM" value="1" caption="Number of switchable Power Domain"/>
              <param name="INSTANCE_ID" value="1" caption="Instance index for PM"/>
              <param name="HAS_IDLE2_SLEEP_AS_IDLE" value="1" caption="IDLE2 Sleep mode is called IDLE"/>
              <param name="HAS_BBIASTR_BIT" value="1" caption="one if RAM HS can be back biased"/>
              <param name="HAS_DPGPDSW_BIT" value="1" caption="one if RAM HS can be back biased"/>
              <param name="HAS_PLCFG" value="1" caption="Performance Level Configuration supported"/>
              <param name="HAS_PDCFG_BIT" value="1" caption="PDCFG bit is present"/>
              <param name="HAS_PWCFG" value="1" caption="PWCFG register is present"/>
              <param name="HAS_OFF_SLEEP" value="1" caption="OFF Sleep mode supported"/>
            </parameters>
          </instance>
        </module>
        <module name="PORT" id="U2210" version="3.1.0">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x40003000"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
            </signals>
            <parameters>
              <param name="BITS" value="93"/>
              <param name="DRVSTR" value="1" caption="DRVSTR supported?"/>
              <param name="EV_NUM" value="4"/>
              <param name="GROUPS" value="2"/>
              <param name="MSB" value="92"/>
              <param name="ODRAIN" value="0" caption="ODRAIN supported?"/>
              <param name="PPP_IMPLEMENTED" value="0" caption="IOBUS2 implemented?"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Secure I/Os supported?"/>
              <param name="SLEWLIM" value="0" caption="SLEWLIM supported?"/>
              <param name="INSTANCE_ID" value="12" caption="Instance index for PORT"/>
            </parameters>
          </instance>
        </module>
        <module name="PTC" id="U2215" version="5.0.0">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42004000"/>
            <signals>
              <signal group="DRV" index="0" function="F" pad="PA00"/>
              <signal group="DRV" index="1" function="F" pad="PA01"/>
              <signal group="DRV" index="2" function="F" pad="PA02"/>
              <signal group="DRV" index="3" function="F" pad="PA03"/>
              <signal group="DRV" index="4" function="F" pad="PA05"/>
              <signal group="DRV" index="5" function="F" pad="PA06"/>
              <signal group="DRV" index="6" function="F" pad="PA08"/>
              <signal group="DRV" index="7" function="F" pad="PA09"/>
              <signal group="DRV" index="8" function="F" pad="PA10"/>
              <signal group="DRV" index="9" function="F" pad="PA11"/>
              <signal group="DRV" index="10" function="F" pad="PA14"/>
              <signal group="DRV" index="11" function="F" pad="PA15"/>
              <signal group="DRV" index="12" function="F" pad="PA16"/>
              <signal group="DRV" index="13" function="F" pad="PA17"/>
              <signal group="DRV" index="14" function="F" pad="PA18"/>
              <signal group="DRV" index="15" function="F" pad="PA19"/>
              <signal group="DRV" index="16" function="F" pad="PA22"/>
              <signal group="DRV" index="17" function="F" pad="PA23"/>
              <signal group="DRV" index="18" function="F" pad="PA30"/>
              <signal group="DRV" index="19" function="F" pad="PA31"/>
              <signal group="DRV" index="20" function="F" pad="PB08"/>
              <signal group="DRV" index="21" function="F" pad="PB09"/>
              <signal group="DRV" index="22" function="F" pad="PA20"/>
              <signal group="DRV" index="23" function="F" pad="PA21"/>
              <signal group="DRV" index="24" function="F" pad="PA12"/>
              <signal group="DRV" index="25" function="F" pad="PA13"/>
              <signal group="ECI" index="0" function="B" pad="PA03"/>
              <signal group="ECI" index="1" function="B" pad="PA04"/>
              <signal group="ECI" index="2" function="B" pad="PA05"/>
              <signal group="ECI" index="3" function="B" pad="PA06"/>
              <signal group="X" index="0" function="B" pad="PA00"/>
              <signal group="Y" index="0" function="B" pad="PA00"/>
              <signal group="X" index="1" function="B" pad="PA01"/>
              <signal group="Y" index="1" function="B" pad="PA01"/>
              <signal group="X" index="2" function="B" pad="PA02"/>
              <signal group="Y" index="2" function="B" pad="PA02"/>
              <signal group="X" index="3" function="B" pad="PA03"/>
              <signal group="Y" index="3" function="B" pad="PA03"/>
              <signal group="X" index="4" function="B" pad="PA05"/>
              <signal group="Y" index="4" function="B" pad="PA05"/>
              <signal group="X" index="5" function="B" pad="PA06"/>
              <signal group="Y" index="5" function="B" pad="PA06"/>
              <signal group="X" index="6" function="B" pad="PA08"/>
              <signal group="Y" index="6" function="B" pad="PA08"/>
              <signal group="X" index="7" function="B" pad="PA09"/>
              <signal group="Y" index="7" function="B" pad="PA09"/>
              <signal group="X" index="8" function="B" pad="PA10"/>
              <signal group="Y" index="8" function="B" pad="PA10"/>
              <signal group="X" index="9" function="B" pad="PA11"/>
              <signal group="Y" index="9" function="B" pad="PA11"/>
              <signal group="X" index="10" function="B" pad="PA14"/>
              <signal group="Y" index="10" function="B" pad="PA14"/>
              <signal group="X" index="11" function="B" pad="PA15"/>
              <signal group="Y" index="11" function="B" pad="PA15"/>
              <signal group="X" index="12" function="B" pad="PA16"/>
              <signal group="Y" index="12" function="B" pad="PA16"/>
              <signal group="X" index="13" function="B" pad="PA17"/>
              <signal group="Y" index="13" function="B" pad="PA17"/>
              <signal group="X" index="14" function="B" pad="PA18"/>
              <signal group="Y" index="14" function="B" pad="PA18"/>
              <signal group="X" index="15" function="B" pad="PA19"/>
              <signal group="Y" index="15" function="B" pad="PA19"/>
              <signal group="X" index="16" function="B" pad="PA22"/>
              <signal group="Y" index="16" function="B" pad="PA22"/>
              <signal group="X" index="17" function="B" pad="PA23"/>
              <signal group="Y" index="17" function="B" pad="PA23"/>
              <signal group="X" index="18" function="B" pad="PA30"/>
              <signal group="Y" index="18" function="B" pad="PA30"/>
              <signal group="X" index="19" function="B" pad="PA31"/>
              <signal group="Y" index="19" function="B" pad="PA31"/>
              <signal group="X" index="20" function="B" pad="PB08"/>
              <signal group="Y" index="20" function="B" pad="PB08"/>
              <signal group="X" index="21" function="B" pad="PB09"/>
              <signal group="Y" index="21" function="B" pad="PB09"/>
              <signal group="X" index="22" function="B" pad="PA20"/>
              <signal group="Y" index="22" function="B" pad="PA20"/>
              <signal group="X" index="23" function="B" pad="PA21"/>
              <signal group="Y" index="23" function="B" pad="PA21"/>
              <signal group="X" index="24" function="B" pad="PA12"/>
              <signal group="Y" index="24" function="B" pad="PA12"/>
              <signal group="X" index="25" function="B" pad="PA13"/>
              <signal group="Y" index="25" function="B" pad="PA13"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EOC" value="44" caption="Index of DMA EOC trigger"/>
              <param name="DMAC_ID_SEQ" value="45" caption="Index of DMA SEQ trigger"/>
              <param name="DMAC_ID_WCOMP" value="46" caption="Index of DMA WCOMP trigger"/>
              <param name="GCLK_ID" value="31" caption="Index of Generic Clock"/>
              <param name="LINES_MSB" value="31"/>
              <param name="LINES_NUM" value="32" caption="Number of PTC lines"/>
              <param name="INSTANCE_ID" value="80" caption="Instance index for PTC"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="U2239" version="3b0">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x40000C00"/>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="0"/>
              <param name="NUMBER_OF_EXTWAKE" value="0" caption="number of external wakeup line"/>
              <param name="INSTANCE_ID" value="3" caption="Instance index for RSTC"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2250" version="3a1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40002400"/>
            <signals>
              <signal group="IN" index="0" function="G" pad="PA08"/>
              <signal group="IN" index="1" function="G" pad="PA09"/>
              <signal group="IN" index="2" function="G" pad="PA16"/>
              <signal group="IN" index="3" function="G" pad="PA17"/>
              <signal group="OUT" index="0" function="G" pad="PA18"/>
              <signal group="OUT" index="1" function="G" pad="PA19"/>
              <signal group="OUT" index="2" function="G" pad="PA22"/>
              <signal group="OUT" index="3" function="G" pad="PA23"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TIMESTAMP" value="1" caption="DMA RTC timestamp trigger"/>
              <param name="GPR_NUM" value="2" caption="Number of General-Purpose Registers"/>
              <param name="NUM_OF_ALARMS" value="1" caption="Number of Alarms"/>
              <param name="NUM_OF_BKREGS" value="0" caption="Number of Backup Registers"/>
              <param name="NUM_OF_COMP16" value="2" caption="Number of 16-bit Comparators"/>
              <param name="NUM_OF_COMP32" value="1" caption="Number of 32-bit Comparators"/>
              <param name="NUM_OF_TAMPERS" value="8" caption="Number of Tamper Inputs"/>
              <param name="PER_NUM" value="8" caption="Number of Periodic Intervals"/>
              <param name="INSTANCE_ID" value="9" caption="Instance index for RTC"/>
            </parameters>
          </instance>
        </module>
        <module name="SCB" version="1.0.0">
          <instance name="SCB">
            <register-group name="SCB" name-in-module="SCB" address-space="base" offset="0xE000ED00"/>
