Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.141/atdf/PIC32CM2532LE00048.atdf
      <value-group name="AC_STATUSA__WSTATE1">
        <value name="ABOVE" caption="Signal is above window" value="0"/>
        <value name="INSIDE" caption="Signal is inside window" value="1"/>
        <value name="BELOW" caption="Signal is below window" value="2"/>
      </value-group>
      <value-group name="AC_WINCTRL__WINTSEL0">
        <value name="ABOVE" caption="Interrupt on signal above window" value="0"/>
        <value name="INSIDE" caption="Interrupt on signal inside window" value="1"/>
        <value name="BELOW" caption="Interrupt on signal below window" value="2"/>
        <value name="OUTSIDE" caption="Interrupt on signal outside window" value="3"/>
      </value-group>
      <value-group name="AC_WINCTRL__WINTSEL1">
        <value name="ABOVE" caption="Interrupt on signal above window" value="0"/>
        <value name="INSIDE" caption="Interrupt on signal inside window" value="1"/>
        <value name="BELOW" caption="Interrupt on signal below window" value="2"/>
        <value name="OUTSIDE" caption="Interrupt on signal outside window" value="3"/>
      </value-group>
      <value-group name="AC_COMPCTRL__FLEN">
        <value name="OFF" caption="No filtering" value="0"/>
        <value name="MAJ3" caption="3-bit majority function (2 of 3)" value="1"/>
        <value name="MAJ5" caption="5-bit majority function (3 of 5)" value="2"/>
      </value-group>
      <value-group name="AC_COMPCTRL__HYST">
        <value name="HYST50" caption="50mV" value="0"/>
        <value name="HYST70" caption="70mV" value="1"/>
        <value name="HYST90" caption="90mV" value="2"/>
        <value name="HYST110" caption="110mV" value="3"/>
      </value-group>
      <value-group name="AC_COMPCTRL__INTSEL">
        <value name="TOGGLE" caption="Interrupt on comparator output toggle" value="0"/>
        <value name="RISING" caption="Interrupt on comparator output rising" value="1"/>
        <value name="FALLING" caption="Interrupt on comparator output falling" value="2"/>
        <value name="EOC" caption="Interrupt on end of comparison (single-shot mode only)" value="3"/>
      </value-group>
      <value-group name="AC_COMPCTRL__MUXNEG">
        <value name="AIN0" caption="I/O pin 0 for COMPCTRL0/1" value="0"/>
        <value name="AIN4" caption="I/O pin 0 for COMPCTRL2/3" value="0"/>
        <value name="AIN1" caption="I/O pin 1 for COMPCTRL0/1" value="1"/>
        <value name="AIN5" caption="I/O pin 1 for COMPCTRL2/3" value="1"/>
        <value name="AIN2" caption="I/O pin 2 for COMPCTRL0/1" value="2"/>
        <value name="AIN6" caption="I/O pin 2 for COMPCTRL2/3" value="2"/>
        <value name="AIN3" caption="I/O pin 3 for COMPCTRL0/1" value="3"/>
        <value name="AIN7" caption="I/O pin 3 for COMPCTRL2/3" value="3"/>
        <value name="GND" caption="Ground" value="4"/>
        <value name="VSCALE" caption="VDD Scaler" value="5"/>
        <value name="BANDGAP" caption="Internal Bandgap Voltage" value="6"/>
        <value name="DAC" caption="DAC Voltage Output 0 for COMPCTRL0/2" value="7"/>
        <value name="OPAMP2" caption="OPAMP2 Output for COMPCTRL1/3" value="7"/>
      </value-group>
      <value-group name="AC_COMPCTRL__MUXPOS">
        <value name="AIN0" caption="I/O pin 0 for COMPCTRL0/1" value="0"/>
        <value name="AIN4" caption="I/O pin 0 for COMPCTRL2/3" value="0"/>
        <value name="AIN1" caption="I/O pin 1 for COMPCTRL0/1" value="1"/>
        <value name="AIN5" caption="I/O pin 1 for COMPCTRL2/3" value="1"/>
        <value name="AIN2" caption="I/O pin 2 for COMPCTRL0/1" value="2"/>
        <value name="AIN6" caption="I/O pin 2 for COMPCTRL2/3" value="2"/>
        <value name="AIN3" caption="I/O pin 3 for COMPCTRL0/1" value="3"/>
        <value name="AIN7" caption="I/O pin 3 for COMPCTRL2/3" value="3"/>
        <value name="VSCALE" caption="VDD Scaler" value="4"/>
      </value-group>
      <value-group name="AC_COMPCTRL__OUT">
        <value name="OFF" caption="The output of COMPn is not routed to the COMPn I/O port" value="0"/>
        <value name="ASYNC" caption="The asynchronous output of COMPn is routed to the COMPn I/O port" value="1"/>
        <value name="SYNC" caption="The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port" value="2"/>
      </value-group>
      <value-group name="AC_COMPCTRL__SPEED">
        <value name="LOW" caption="Low speed" value="0"/>
        <value name="MEDLOW" caption="Medium low speed" value="1"/>
        <value name="MEDHIGH" caption="Medium high speed" value="2"/>
        <value name="HIGH" caption="High speed" value="3"/>
      </value-group>
    </module>
    <module name="ADC" id="U2247" version="2.4.0" caption="Analog Digital Converter">
      <register-group name="ADC" caption="Analog Digital Converter">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run During Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="RW" size="1" initval="0x00" caption="Control B">
          <bitfield name="PRESCALER" caption="Prescaler Configuration" mask="0x7" values="ADC_CTRLB__PRESCALER"/>
        </register>
        <register name="REFCTRL" offset="0x2" rw="RW" size="1" initval="0x00" caption="Reference Control">
          <bitfield name="REFSEL" caption="Reference Selection" mask="0xF" values="ADC_REFCTRL__REFSEL"/>
          <bitfield name="REFCOMP" caption="Reference Buffer Offset Compensation Enable" mask="0x80"/>
        </register>
        <register name="EVCTRL" offset="0x3" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="FLUSHEI" caption="Flush Event Input Enable" mask="0x1"/>
          <bitfield name="STARTEI" caption="Start Conversion Event Input Enable" mask="0x2"/>
          <bitfield name="FLUSHINV" caption="Flush Event Invert Enable" mask="0x4"/>
          <bitfield name="STARTINV" caption="Start Event Invert Enable" mask="0x8"/>
          <bitfield name="RESRDYEO" caption="Result Ready Event Out" mask="0x10"/>
          <bitfield name="WINMONEO" caption="Window Monitor Event Out" mask="0x20"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Disable" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun Interrupt Disable" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Disable" mask="0x4"/>
        </register>
